futurehome/stm32bfg/AVR/ChainProtocol_Module.c
/*
 * ChainProtocol_Module.c
 *
 * Created: 08/10/2012 21:40:04
 *  Author: NASSER GHOSEIRI
 * Company: Butterfly Labs
 */ 

// Include standard definitions
#include "stm32f10x.h"

#include "std_defs.h"
#include "Generic_Module.h"
#include "ChainProtocol_Module.h"
#include <string.h>
#include "AVR32X\AVR32_Module.h"
//#include <avr32/io.h>
#include "AVR32_OptimizedTemplates.h"
#include "HostInteractionProtocols.h" // We use some constant here...
#include "bf_peripheral_timer.h"

// *** IREG - RX Status (8 Bit)
//
// MSB                                              LSB
// +-------------------------+----------+-----+------+
// | BC | LP | Length (3Bit) | OVERFLOW | ERR | DATA |
// +----+----+---------------+----------+-----+------+
//   7    6       5..3            2        1      0


// *** IREG - RX Senders Address (8 Bit)
// 
// MSB                                              LSB
// +-------------------------+-----------------------+
// |            N/C          |    Senders Address    |
// +-------------------------+-----------------------+
//   7                     5   4                    0


// *** IREG - TX Status (8 Bit)
//
// MSB                                             LSB
// +-----------+----------+--------+-----------------+
// | N/C (5Bit)| TxInProg | TxDone |       N/C       |
// +-----------+----------+--------+-----------------+
//    7 .. 3        2          1            0


// *** IREG - RX Control (8 Bit)
//
// MSB                                             LSB
// +-------------------------------+-----------------+
// |  N/C (7 Bits)                 | Clear Registers |
// +-------------------------------+-----------------+
//              7 .. 1                      0


// *** IREG - TX Control (8 Bit)
//
// MSB                                             LSB
// +-----------+--------+----+----------------+------+
// |BitCorrect | XXXXXX | LP | Length (3Bits) | SEND |
// +-----------+--------+----+----------------+------+
//      7         6..5     4        3 .. 1        0


// *** IREG - TX TARGET ADRS (8 Bit)
//
// MSB                                             LSB
// +------------------------------+------------------+
// |  N/C (3 Bits)                | 5Bit Target ADRS |
// +------------------------------+------------------+
//              7 .. 5     	          4 .. 0


// *** IREG - Chain Status (8 Bit)
//
// MSB                                             LSB
// +--------------------------+----------+-----------+
// |  N/C (6 Bits)            | Chain IN | Chain OUT |
// +--------------------------+----------+-----------+
//              7 .. 2     	      1           0


// *** IREG - Master Control Register (8 Bit)
//
// MSB                                             LSB
// +-------------+------+---------------------+------+
// | PassThrough | NC   | CPLD ADDRESS (5Bit) | MSTR |
// +-------------+------+---------------------+------+
//      7           6           5..1             0

char __OUR_CPLD_ID = 0;
char __OUR_CHAIN_LENGTH = 0;
int  __internal_are_we_master = FALSE;

// This is the XLINK out box buffer
char XLINK_Outbox[4096]; 
char XLINK_Device_Status;
char XLINK_Outbox_Length;

u32 MAST_TICK_COUNTER;
unsigned int GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK;
unsigned int XLINK_chain_device_count;




// Our device map
  char XLINK_Internal_DeviceMap[32] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
#define XLINK_Internal_DeviceMap_RetryCount 2

// Initialize
void init_XLINK()
{
	// Init CPLD XLINK Info
	__AVR32_CPLD_SetAccess();
	__AVR32_CPLD_Initialize();
	XLINK_set_cpld_passthrough(0); // Disable pass-through
	XLINK_set_cpld_id(0); // Initialize our ID
	XLINK_chain_device_count = 0;
	XLINK_set_device_status(XLINK_DEVICE_STATUS_NO_TRANS);
	XLINK_set_outbox("",0);
	
	// Reset xlink address map
	////////GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK = 0; // All devices are off-line
}



int	XLINK_detect_if_we_are_master()
{
	int v_counter = 0;
	int total_runs = 0;
	int bAreWeMaster = TRUE;
	// First check to see if CPLD is present. If it's not, then we're master for sure... (Either Jalapeno or Single)
	if (XLINK_is_cpld_present() == FALSE) return TRUE;
	
	// Check our CHAIN-IN activation. If it's active, then we're a slave. Otherwise we're a master.
	// We'll try this for 15,000 times. If for a period of 5000 times the state did not change, then we're ok
	
	
	while (v_counter < 15000)	
	{
		if (total_runs >= 5000)
		{
			bAreWeMaster = FALSE;
			break;
		}
		else
		{
			if ((XLINK_get_chain_status() & CHAIN_IN_BIT) == CHAIN_IN_BIT) // Meaning we have a CHAIN-IN Connected
			{
				total_runs++;
			}				
			else
			{
				if (total_runs > 2) total_runs -= 2;
			}				
		}					
		
		v_counter++;
	}	
	
	// If we've reached here, it means we're a master
	return bAreWeMaster;
}

// Send a string via XLINK (SLAVE calls this)
void XLINK_SLAVE_respond_string(char* szStringToSend)
{
	char bTimeoutDetected = FALSE;
	XLINK_SLAVE_respond_transact(szStringToSend, 
								 strlen(szStringToSend), 
								 __XLINK_TRANSACTION_TIMEOUT__, 
								 &bTimeoutDetected, FALSE);
}

// Called by the master, used to determine whether the chain exists or not
int XLINK_MASTER_chainDevicesExists()
{
	if ((XLINK_get_chain_status() & CHAIN_OUT_BIT) == CHAIN_OUT_BIT)
		return TRUE;
	else
		return FALSE;
}

// How many devices exist in chain?
int XLINK_MASTER_getChainLength()
{
	unsigned char x;
	int iTotalDevicesInChain = 0;
	for (x = 0; x < 31; x++) 
	{
		if ( (/*GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK*/x & ((1<<x) & 0x0FFFFFFFF)) != 0) 
		{
			iTotalDevicesInChain++;
		}			
	}		
	
	return iTotalDevicesInChain;
}

// XLINK Is Device Present
char XLINK_MASTER_Is_Device_Present(char aID)
{
	// Our device detection counter...
	//int iDevDetectionCount = 0;
	char bTimedOut = FALSE;
	char bDevNotResponded = FALSE;
	char szResponse[10];
	unsigned int iRespLen = 0;
	//char iBC = 0;
	//char iLP = 0;
	//char iSendersAddress = 0;
	
	// Is the device present?
	// set the proper command
	char sz_cmd[3];
	sz_cmd[0] = 'Z';
	sz_cmd[2] = 'X';
	sz_cmd[1] = 'C'; ///////PROTOCOL_REQ_PRESENCE_DETECTION;  'C' added by JJ
	
	// Send a message to general dispatch
	
	
	iRespLen = 0;
	szResponse[0] = 0; 
	szResponse[1] = 0; 
	szResponse[2] = 0; 
	szResponse[3] = 0;
			
	XLINK_MASTER_transact(aID, sz_cmd, 3, szResponse, &iRespLen, 128, __XLINK_TRANSACTION_TIMEOUT__, &bDevNotResponded, &bTimedOut, TRUE);
	
	// Check response errors
	if (bTimedOut || bDevNotResponded)
	{
		return FALSE;
	}	
	
	// Device did respond, now was it correct?
	if ((szResponse[0] == 'P') && (szResponse[1] == 'R') && (szResponse[2] == 'S') && (szResponse[3] == 'N') && (iRespLen == 4))
	{
		// We're ok, Blink for a while....
		return TRUE;
	}
	else
	{
		// Then we have no more devices, exit the loop
		return FALSE;
	}	

