futurehome/stm32bfg/AVR/ChainProtocol_Module.c
}

// The Chain-Startup function
int XLINK_MASTER_Start_Chain()
{
	char  iActualID	;
	unsigned char bSucceeded;
	// What we do here is we keep sending PROTOCOL_PRESENCE_DETECTION until we no UL32er receive
	// a response. For each response we receive, we send a SET-ID command. The responding device
	// we have an ID assigned to it and will no UL32er response to PROTOCOL_PRESENCE_DETECTION command
	// OK We've detected a ChainForward request. First Send 'OK' to the host
	
	// Check CPLD, is CHAIN_OUT connected?
	char iChainOutConnectValue = 0;
	MACRO__AVR32_CPLD_Read(iChainOutConnectValue, CPLD_ADDRESS_CHAIN_STATUS);
	
	if ((iChainOutConnectValue & CHAIN_OUT_BIT) == 0)
	{
		// Meaning there is not chain-out connection
		MAST_TICK_COUNTER += 5;
		return TRUE;
	}
	
	// Device Availability Bit
	// GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK
	// Each bit represents one device. Bit 1 means Device address 1...
	iActualID = 1; // The ID we have to assign
	
	// Main loop
	while (iActualID < 0x01F) // Maximum 30 devices supported. ID Starts from 1
	{
		// Reset Watchdog
		WATCHDOG_RESET;
		
		// Check if this thing already exists
		if (XLINK_MASTER_Is_Device_Present(iActualID) == TRUE)
		{
			GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK |= (1 << iActualID);
			XLINK_Internal_DeviceMap[iActualID] = XLINK_Internal_DeviceMap_RetryCount; // 2 Retries set...
			iActualID++;
			continue;
		}
		
		// Perform
		bSucceeded = FALSE;
		XLINK_MASTER_Scan_And_Register_Device(iActualID, 10, 10, &bSucceeded);
		
		if (bSucceeded == FALSE)
		{
			// Abort, we're done
			break;
		}
		else
		{
			// ID successfully assigned
			iActualID++;
		}
	}
	
	// At this point, the iActualID shows the number of devices in chain
	XLINK_chain_device_count = iActualID - 1;
	
	// We've been successful
	return TRUE;
}


// XLINK Refresh chain
void XLINK_MASTER_Refresh_Chain()
{
	char aIDToAssign;
	unsigned char bSuccess;
	unsigned int iValueToSet;
	unsigned char bSucceeded;
	//unsigned int iValueToSet;

	// What we do here is we check each device in the flag.
	// If they don't respond then we issue a chain-scan.
	// Should the device respond to chain-scan then we set the address
	// and register the device. If not, we reduce device count...
	// This operation could take a while to execute, so Watchdog Reset is important
	  char bNoResponseToEnumeration = FALSE;
	
	// First question, is the CPLD present at all?
	if (XLINK_is_cpld_present() == FALSE) return;
		
	// Main counter
	for (aIDToAssign = 1; aIDToAssign < 31; aIDToAssign++)
	{
		// Reset Watchdog
		WATCHDOG_RESET;
		
		// It means the device should be present... Now is it?
		if (((GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK & (1 << aIDToAssign)) != 0))
		{
			if (XLINK_MASTER_Is_Device_Present(aIDToAssign))
			{
				// If present the we do nothing... All is ok!
				XLINK_Internal_DeviceMap[aIDToAssign] = XLINK_Internal_DeviceMap_RetryCount;				
				continue;	
			}
			else
			{
				if (XLINK_MASTER_Is_Device_Present(aIDToAssign))
				{
					// If present the we do nothing... All is ok!
					continue;
				}
				else
				{

					bSuccess = FALSE;
							
					// We've tried all we could, no luck unfortunately
					GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK &= (unsigned int)((~(1 << aIDToAssign)) & 0x0FFFFFFFF);	
							
					// In this case we do try...
					XLINK_MASTER_Scan_And_Register_Device(aIDToAssign, 5, 6, &bSuccess);
							
					// Did we succeed? Update the flag accordingly
					if (bSuccess)
					{
						iValueToSet = (1 << aIDToAssign);
						GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK |= iValueToSet;
						XLINK_Internal_DeviceMap[aIDToAssign] = XLINK_Internal_DeviceMap_RetryCount; // 
					}
					else // Clear
					{
						// No response to enumeration was detected
						bNoResponseToEnumeration = TRUE; // Meaning we shouldn't enumerate anymore, since no device responded	
						
						// Continue...
						if (XLINK_Internal_DeviceMap[aIDToAssign] == 0)
						{
							GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK &= (unsigned int)((~(1 << aIDToAssign)) & 0x0FFFFFFFF);
						}						
						else
						{
							XLINK_Internal_DeviceMap[aIDToAssign] -= 1;
						}
					}
				}
			}
			
		}
		else
		{
			
			// Then see if we can find a new device in chain
			bSucceeded = FALSE;
			
			if (bNoResponseToEnumeration == FALSE)
			{
				// In this case we do try...		
				XLINK_MASTER_Scan_And_Register_Device(aIDToAssign, 5, 6, &bSucceeded);
			
				// Did we succeed? Update the flag accordingly
				if (bSucceeded)
				{
					iValueToSet = (1 << aIDToAssign);
					GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK |= iValueToSet;
					XLINK_Internal_DeviceMap[aIDToAssign] = XLINK_Internal_DeviceMap_RetryCount;
				}					
				else // Clear
				{
					// Enumeration response null
					bNoResponseToEnumeration = TRUE;
					
					// Continue...
					if (XLINK_Internal_DeviceMap[aIDToAssign] == 0)
					{
						GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK &= (unsigned int)((~(1 << aIDToAssign)) & 0x0FFFFFFFF);
						bNoResponseToEnumeration = TRUE; // Meaning we shouldn't enumerate anymore, since no device responded
						XLINK_Internal_DeviceMap[aIDToAssign] = XLINK_Internal_DeviceMap_RetryCount;	
					}
					else
					{
						XLINK_Internal_DeviceMap[aIDToAssign] -= 1;
					}
					
				}									
			}
			else
			{
				if (XLINK_Internal_DeviceMap[aIDToAssign] == 0)
				{
					// Since in the past an enumeration has failed, there is no reason for us to re-enumerate now...
					GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK &= (unsigned int)((~(1 << aIDToAssign)) & 0x0FFFFFFFF);			
				}
				else
				{
					XLINK_Internal_DeviceMap[aIDToAssign] -= 1;					
				}					
			}
		}
	}	
}

// XLINK Scan and Register Device
void XLINK_MASTER_Scan_And_Register_Device(unsigned char  aIDToAssign,
										   unsigned char  aPassthroughRetryCounts,
										   unsigned char  aConnectRetryCounts,
										   unsigned char* aSucceeded)
{
	// Variables
	char szRespData[32];
	char sz_cmd[16];
	unsigned int iRespLen = 0;
	char bDeviceNotResponded = 0;
	char bTimeoutDetected = 0;
	unsigned int iTotalRetryCount = 0;
	unsigned int iPassthroughRetryCount;
			
	// Our device detection counter...
	int iDevDetectionCount = 0;
			
	// Did we succeed?
	*aSucceeded = FALSE;
	
	while (TRUE)
	{		
		// set the proper command
		sz_cmd[0] = 'Z';
		sz_cmd[2] = 'X';
		sz_cmd[1] = PROTOCOL_REQ_PRESENCE_DETECTION;

		// Clear the response message
		szRespData[0] = 0; szRespData[1] = 0; szRespData[2] = 0; szRespData[3] = 0; szRespData[4] = 0;
		szRespData[5] = 0; szRespData[6] = 0; szRespData[7] = 0; szRespData[8] = 0; szRespData[9] = 0;

		// Send a message to general dispatch
		XLINK_MASTER_transact(XLINK_GENERAL_DISPATCH_ADDRESS,
							  sz_cmd,
							  3,
							  szRespData,
							  &iRespLen,
							  128,					// Maximum response length
							  __XLINK_TRANSACTION_TIMEOUT__,			// 400us timeout
							  &bDeviceNotResponded,
							  &bTimeoutDetected,
							  TRUE);				// We're master

		// Check response errors
		if (bDeviceNotResponded || bTimeoutDetected)
		{
			// We will try for aConnectRetryCounts times here
			if (iDevDetectionCount++ > aConnectRetryCounts)
			{
				// Then we have no more devices, exit the loop
				*aSucceeded = FALSE;
				return;
			}
			else continue;
		}
			
		// reset iDevDetectionCount since we've succeeded in getting a response
		iDevDetectionCount = 0;

		// Check response, is it 'Present'?
		if ((szRespData[0] == 'P') && (szRespData[1] == 'R') && (szRespData[2] == 'S') && (szRespData[3] == 'N') && (iRespLen == 4))
		{
			// We're ok, Blink for a while....
		}
		else
		{
			// We will try for 5 times here
			if (iDevDetectionCount++ > aConnectRetryCounts)
			{
				// Then we have no more devices, exit the loop
				break;
			}
			else continue; // Otherwise we try again
				
