futurehome/stm32bfg/AVR/ChainProtocol_Module.c
		}
			
		// OK, We have 'Present', set the device ID
		// set the proper command (This is valid in XLINK: AA BB C4 <ID>, device will then activate pass-through
		sz_cmd[0] = 0xAA;
		sz_cmd[1] = 0xBB;
		sz_cmd[2] = 0xC4;
		sz_cmd[3] = aIDToAssign;
			
		// Clear the response message
		szRespData[0] = 0; szRespData[1] = 0; szRespData[2] = 0; szRespData[3] = 0; szRespData[4] = 0;
		szRespData[5] = 0; szRespData[6] = 0; szRespData[7] = 0; szRespData[8] = 0; szRespData[9] = 0;

			
		// Send a message to general dispatch
		XLINK_MASTER_transact(XLINK_GENERAL_DISPATCH_ADDRESS,//
							  sz_cmd,						 //
							  4,							 //
							  szRespData,					 //
							  &iRespLen,					 //
							  128,							 // Maximum response length
							  __XLINK_TRANSACTION_TIMEOUT__, // 400us timeout
							  &bDeviceNotResponded,			 //
							  &bTimeoutDetected,			 //
							  TRUE);						 // We're master
			

		// Check response errors
		if ( (bDeviceNotResponded) || (bTimeoutDetected) || (!((szRespData[0] == 'A') && (szRespData[1] == 'C') && (szRespData[2] == 'K') && (iRespLen == 3))) )
		{
			if (iTotalRetryCount++ >= aPassthroughRetryCounts)
			{
				// Device did not respond to our message for 200 attempts.
				// Either it doesn't exist or has already  taken the ID but we failed to received the
				// confirmation from it. Should this be the case, we can discover it by trying to execute
				// presence detection on it's new address. If it responded, then we're ok.
					
				int iPresenceDetectionRetryCount = 0;
				int iDeviceIsPresent = FALSE;
					
				// Note that we will execute this command for 40 times maximum
				// set the proper command
				while (iPresenceDetectionRetryCount++ < 40)
				{
					sz_cmd[0] = 'Z';
					sz_cmd[2] = 'X';
					sz_cmd[1] = PROTOCOL_REQ_PRESENCE_DETECTION;
						
					// Clear the response message
					szRespData[0] = 0; szRespData[1] = 0; szRespData[2] = 0; szRespData[3] = 0; szRespData[4] = 0;
					szRespData[5] = 0; szRespData[6] = 0; szRespData[7] = 0; szRespData[8] = 0; szRespData[9] = 0;
						
					// Send a message to general dispatch
					XLINK_MASTER_transact(aIDToAssign,
										  sz_cmd,
										  3,
										  szRespData,
										  &iRespLen,
										  128,					// Maximum response length
										  __XLINK_TRANSACTION_TIMEOUT__,			// 400us timeout
										  &bDeviceNotResponded,
										  &bTimeoutDetected,
										  TRUE);				// We're master

					// Check response errors
					if (bDeviceNotResponded || bTimeoutDetected)
					{
						// We have no more devices...
						continue;
					}
						
					// Check response
					if ((szRespData[0] == 'P') && (szRespData[1] == 'R') && (szRespData[2] == 'S') && (szRespData[3] == 'N') && (iRespLen == 4))
					{
						// We're ok
						iDeviceIsPresent = TRUE;
						break;
					}
				}
					
				// Did we fail?
				if (iDeviceIsPresent == FALSE)
				{
					// Chain Device INIT has failed! This is bad..
					aSucceeded = FALSE;				
					return;
				}

			}  else continue; // Otherwise we repeat
		}

		// Now ask the device to enable pass-through
		sz_cmd[0] = 'Z';
		sz_cmd[1] = PROTOCOL_REQ_XLINK_ALLOW_PASS;
		sz_cmd[2] = 'X';
				
		iPassthroughRetryCount = 0;
				
		while (iPassthroughRetryCount < aPassthroughRetryCounts)
		{
			// First clear the response buffer
			szRespData[0] = 0;
			szRespData[1] = 0;
			szRespData[2] = 0;
			szRespData[3] = 0;
			iRespLen = 0;
					
			// Get response
			XLINK_MASTER_transact(aIDToAssign, // We'll use the actual ID of the device
								  sz_cmd,
								  3,
								  szRespData,
								  &iRespLen,
								  128,
								  __XLINK_TRANSACTION_TIMEOUT__,
								  &bDeviceNotResponded,
								  &bTimeoutDetected,
								  TRUE);
					
			// Check for response
			if (bDeviceNotResponded || bTimeoutDetected)
			{
				// We continue...
				iPassthroughRetryCount++;
				continue;
			}
					
			// If Response was not 'OK' we try again as well
			if (szRespData[0] != 'O' || szRespData[1] != 'K')
			{
				// We continue...
				iPassthroughRetryCount++;
				continue;
			}
					
			// All ok, we exit the function
			*aSucceeded = TRUE;
			return;
		}
		
		// Check if we have succeeded or not by checking the retry count
		if (iPassthroughRetryCount >= aPassthroughRetryCounts)
		{
			// We have failed!
			*aSucceeded = FALSE;
			return;
		}				
	} // end of while(TRUE)
	

	// We're OK
	*aSucceeded = TRUE;
	return;
}

// iAdrs = Target
// szData and iLen is the data stack
void XLINK_send_packet(char iAdrs, char* szData, unsigned int iLen, char LP, char BC)
{
	unsigned char iTotalToSend;
//	char szMMR[4];
	char iTxControlVal;
	char iTX_STATUS;
	
	// Set CPLD Access
	__AVR32_CPLD_SetAccess();

	// Wait until actual buffer is sent...
	while (TRUE)
	{
		iTX_STATUS = 0;
		MACRO_XLINK_get_TX_status(iTX_STATUS);
		if ((iTX_STATUS & CPLD_TX_STATUS_TxInProg) == 0) break;
	}
	
	// We're ready to send...
	// Send data in 4byte packets. Each time we send, we wait for a reception of response package
	// Target device must respond with 'OK' and have its correct address in our packet.
	// Should we not receive the correct data, we'll retransmit the previous packet. This will be repeated
	// for 5 times until we realize that we're out of sync...
	// BitCorrect will handle the flip-flop correction indicator
	
	// Set the target device
	//while (XLINK_get_target_address() != iAdrs)
	MACRO_XLINK_set_target_address(iAdrs);
	
	// *** IREG - TX Control (8 Bit)
	//
	// MSB                                             LSB
	// +-----------+--------+----+----------------+------+
	// |BitCorrect | XXXXXX | LP | Length (3Bits) | SEND |
	// +-----------+--------+----+----------------+------+
	//      7         6..5     4        3 .. 1        0
	
	// Also bitStuff position
	iTotalToSend = (iLen << 1);

	
				
	// Set Data
	MACRO__AVR32_CPLD_BurstTxWrite(szData, CPLD_ADDRESS_TX_BUF_BEGIN);

	// What's the value to write to our TX Control
	iTxControlVal = 0x00;	
	iTxControlVal |= iTotalToSend;		//
	if (LP) iTxControlVal |= CPLD_TX_CONTROL_LP;
		
	// Set BitStuff value
	iTxControlVal |= (BC != 0) ? CPLD_TX_CONTROL_BC : 0;
	
	// Send packet info
	MACRO__AVR32_CPLD_Write(CPLD_ADDRESS_TX_CONTROL, iTxControlVal);
	MACRO__AVR32_CPLD_Write(CPLD_ADDRESS_TX_START, CPLD_ADDRESS_TX_START_SEND);

