futurehome/stm32bfg/AVR/ChainProtocol_Module.c
}

//////////////////////////////////////////////////////////////////////////////
// AUXILIARY FUNCTIONS
//////////////////////////////////////////////////////////////////////////////
void XLINK_wait_packet (char  *data,
						unsigned int *length,
						u32  time_out,
						char  *timeout_detected,
						char  *senders_address,
						char  *LP,
						char  *BC)
{
	char  iActualRXStatus = 0;
	//unsigned char us1 = 0;
	//unsigned char us2 = 0;
	u32 iTimeoutHolder;
	char imrLen;

	// Reset all variables
	*BC = 0;
	*LP = 0;
	*timeout_detected = FALSE;
	*length = 0;
	*senders_address = 0;
	


	iActualRXStatus = XLINK_get_RX_status();
	iTimeoutHolder = MACRO_GetTickCountRet;

	// Wait until actual buffer is sent...
	if ((iActualRXStatus & CPLD_RX_STATUS_DATA) == 0)
	{
		
		// Wait for 25uS
		while (MACRO_GetTickCountRet - iTimeoutHolder < time_out)
		{
			iActualRXStatus = XLINK_get_RX_status();
			if ((iActualRXStatus & CPLD_RX_STATUS_DATA) != 0) break;
		}
		
		// Did we timeout?
		if (MACRO_GetTickCountRet - iTimeoutHolder >= time_out)
		{
			// Ok we've timed out....
			// TODO: We must do something important
			*timeout_detected = 1; // Means we've timed out
			*length		= 0;
			*senders_address = 0;
			return;
		}
	}
	
	// We've received data
	imrLen = 0;
	imrLen = ((iActualRXStatus & 0x38) >> 3);
	*length = imrLen;
	*LP = ((iActualRXStatus & CPLD_RX_STATUS_LP) != 0) ? 1 : 0;
	*BC = ((iActualRXStatus & CPLD_RX_STATUS_BC) != 0) ? 1 : 0;
	*senders_address = __AVR32_CPLD_Read(CPLD_ADDRESS_SENDERS_ADRS);
	__AVR32_CPLD_BurstRxRead(data, CPLD_ADDRESS_RX_BUF_BEGIN);
	__AVR32_CPLD_Write(CPLD_ADDRESS_RX_CONTROL, CPLD_RX_CONTROL_CLEAR);

}

// This is used by master only...
void XLINK_MASTER_transact(char   iAdrs, 
					       char*  szData, 
					       unsigned int  iLen,
						   char*  szResp,
						   unsigned int* response_length,
						   unsigned int  iMaxRespLen,
						   u32    transaction_timeout, // Master timeout
						   char   *bDeviceNotResponded, // Device did not respond, even to the first packet
						   char   *bTimeoutDetected, // Was a timeout detected?
					       char   bWeAreMaster)
{
	u32 iTransactionStartTickcount = MACRO_GetTickCountRet;
	unsigned int iTotalSent = 0;
	char  iBytesToSend = 0;
	char  iLP = 0; // LastPacket
	char  iBC = 0; // BitCorrector ((Note: BitCorrector starts with 0))
	char  iTotalRetryCount = 0; 
		  char iTimeoutDetected = 0;
	  char szDevResponse[4];
	  unsigned int  __iRespLen = 0;
	  char __senders_address = 0;
	  char __lp = 0;
	  char __bc = 0;
	
	  u32 vTemp1 = 0;
	  u32 vTemp2 = 0;
	  u32 vTemp3 = 0;
	
	  unsigned int iExpectedChecksum = 0;
	  char* szDest;
	  	  u32 imrActualHolder = 0;
	  u32 imrActualTime = 0;
	
		
	  //int iUTR_TO_RetryCount = 0;
	 // int iUTR_OTHER_RetryCount = 0;
	
	  //int iUTR_TO_BeforeData_RetryCount = 0;
	  //int iUTR_OTHER_BeforeData_RetryCount = 0;
	
	  //int iUTR_GVAR1 = 0;
	  //int iUTR_GVAR2 = 0;
	  //int iUTR_GVAR3 = 0;	
		
	  //int iUTR_OLD_BC = 0;
	  //int iUTR_OLD_LEN = 0;
	  //int iUTR_OLD_LP = 0;
	   unsigned int iTotalReceived = 0;
	   char iExpectedBC = TRUE; // This is what we expect from the slave as BitCorrector

	// Reset this value
	*bDeviceNotResponded = 0;
	*bTimeoutDetected = 0;
	
	// First check if we are master
	if (bWeAreMaster == 0) return;
	
	// This is how we do it, we start sending packets and we wait for response.
	// Each time we wait for 20us for reply. Should the device not respond, we abort the transaction

		
	// Wait for OK packet for 20us


	// Proceed...
	while (iTotalSent < iLen)
	{
		// We need to reset watchdog
		WATCHDOG_RESET;
				
		// Preliminary calculations
		iBytesToSend = ((iLen - iTotalSent) > 4) ? 4 : (iLen - iTotalSent);
		iLP = ((iTotalSent + iBytesToSend >= iLen) ? 1 : 0);
		iTotalRetryCount = 0;

RETRY_POINT_1:
		// Before doing anything, clear the CPLD
		MACRO_XLINK_clear_RX;
		
		// Send these bytes
		szDest = (char*)(szData + iTotalSent);
		MACRO_XLINK_send_packet(iAdrs, szDest, iBytesToSend, iLP, iBC);
		
		
		// Calculate iExpectedChecksum
		iExpectedChecksum = 0;
		iExpectedChecksum += ((iBytesToSend >= 1) ? szDest[0] : 0);
		iExpectedChecksum += ((iBytesToSend >= 2) ? szDest[1] : 0);
		iExpectedChecksum += ((iBytesToSend >= 3) ? szDest[2] : 0);
		iExpectedChecksum += ((iBytesToSend == 4) ? szDest[3] : 0);
	
		// Reset variables
		iTimeoutDetected = 0;
		__iRespLen = 0;
		__lp = 0;
		__bc = 0;
		
		// Clear szDevResponse
		szDevResponse[0] = 0;
		szDevResponse[1] = 0;
		szDevResponse[2] = 0;
		szDevResponse[3] = 0;
		
		// Wait for response
		MACRO_XLINK_wait_packet(szDevResponse, 
							    __iRespLen, 
							    (__XLINK_WAIT_PACKET_TIMEOUT__ >> 3),  // We operate on reduced timeout... This is to make sure we try more than the slave waits...
								iTimeoutDetected, 
								__senders_address, 
								__lp, 
								__bc);
						  
		// Check master timeout
		vTemp1 = MACRO_GetTickCountRet;
		vTemp3 = vTemp1 - iTransactionStartTickcount;
		
		if (vTemp3 > transaction_timeout) 
		{
			*bTimeoutDetected = 1;
			if (iTotalSent == 0) *bDeviceNotResponded = 1;
			
			// Before doing anything, clear the CPLD
			MACRO_XLINK_clear_RX;			
			return;
		}
		
		// Check for issues
		if (iTimeoutDetected)
		{
			// Ok we've timed out, try for 3 times
			if (iTotalRetryCount ==  (__XLINK_ATTEMPT_RETRY_MAXIMUM__ << 3))
			{
				// We've failed
				*bTimeoutDetected = 1;
				*bDeviceNotResponded = (iTotalSent == 0) ? 1 : 0;
				
				// Before doing anything, clear the CPLD
				MACRO_XLINK_clear_RX;
				return;
			}
			else
			{
				iTotalRetryCount++;
				goto RETRY_POINT_1;
			}
		}
		
		// No timeout was detected, check resp. If it was not ok, try again
		if ((szDevResponse[0] != 'A') || 
			(szDevResponse[1] != 'R') ||
			(szDevResponse[2] != (((iExpectedChecksum & 0x0FF00) >> 8) & 0x0FF)) ||
			(szDevResponse[3] !=  (iExpectedChecksum & 0x0FF)) ||
			(__iRespLen != 4) ||
			(__senders_address != iAdrs)) // Check both for address-match and 'OK' response
		{
			// Ok we've timed out, try for 3 times
			if (iTotalRetryCount ==  (__XLINK_ATTEMPT_RETRY_MAXIMUM__ << 3))
			{
				// We've failed
				*bTimeoutDetected = 2;
				*bDeviceNotResponded = (iTotalSent == 0) ? 1 : 0;
				
