futurehome/stm32bfg/AVR/ChainProtocol_Module.c
				// Before doing anything, clear the CPLD
				MACRO_XLINK_clear_RX;				
				return;
			}
			else
			{
				iTotalRetryCount++;
				goto RETRY_POINT_1;
			}			
		}			
		
		// Resp was OK... Now we continue...
		// Reset retry count
		iTotalRetryCount = 0;
						
		// We've sent 4 more bytes
		iBC = (iBC == 0) ? 1 : 0; // Flip BitCorrector
		iTotalSent += iBytesToSend; // Update total sent
	}
		
				
	// At this stage, the data has been sent, now we must ask Device for results...
	 
	iTotalRetryCount = 0;
	

	
	// We have to reset the BitCorrector, as it will start from 0 for the PUSH part
	iBC = TRUE; // Push must be set to one
	 // char iExpectedBC = TRUE; // This is what we expect from the slave as BitCorrector
	
	// Now we have to wait for data
	while (iTotalReceived < iMaxRespLen)
	{
		// We need to reset watchdog
		WATCHDOG_RESET;
		
		// Before doing anything, clear the CPLD
		MACRO_XLINK_clear_RX;
		
		// Proceed
		MACRO_XLINK_send_packet(iAdrs,"PUSH", 4, iLP, iBC);
		
		// Save old variables
		//iUTR_OLD_LP = __lp;
		//iUTR_OLD_LEN = __iRespLen;
		//iUTR_OLD_BC = __bc;
		
		// Reset variables
		iTimeoutDetected = 0;
		__iRespLen = 0;
		__lp = 0;
		__bc = 0;
		
		// Clear szDevResponse
		szDevResponse[0] = 0;
		szDevResponse[1] = 0;
		szDevResponse[2] = 0;
		szDevResponse[3] = 0;
		
		// We would want to measure something here...
		imrActualHolder = MACRO_GetTickCountRet;
		
		// Wait for response		
		MACRO_XLINK_wait_packet(szDevResponse, 
							    __iRespLen,
								(__XLINK_WAIT_PACKET_TIMEOUT__ >> 2),  // For the first packet (only) we wait u32 time. For the rest, we'll be fast...
								iTimeoutDetected,
								__senders_address,
								__lp,
								__bc);
								
		// Check master timeout
		vTemp1 = MACRO_GetTickCountRet;
		vTemp3 = vTemp1 - iTransactionStartTickcount;
		
		if (vTemp3 > transaction_timeout + __XLINK_WAIT_FOR_DEVICE_RESPONSE__)
		{
			*bTimeoutDetected = (iTotalReceived == 0) ? 3 : 77;
			if (iTotalSent == 0) *bDeviceNotResponded = 1;
			
			// Before doing anything, clear the CPLD
			MACRO_XLINK_clear_RX;
			return;
		}
		
		// Check for issues
		if (iTimeoutDetected)
		{
			// Ok we've timed out, try for 3 times
			if (iTotalRetryCount == (__XLINK_ATTEMPT_RETRY_MAXIMUM__ << 2))
			{
				// We've failed
				*bTimeoutDetected = 4;
				*bDeviceNotResponded = (iTotalSent == 0) ? 1 : 0;
				
				// Before doing anything, clear the CPLD
				MACRO_XLINK_clear_RX;				
				return;
			}
			else
			{
				// We only increase retry count when the device has started sending us the data
				// Otherwise, we're waiting for device to process and respond, hence we can't call it
				// a retry attempt...
			    if (iTotalReceived != 0)
				{
					 iTotalRetryCount++;
				}					 
				continue;
			}
		}
		
		// No timeout was detected, check resp. If it was not ok, try again
		if (__senders_address != iAdrs || __iRespLen == 0 || iExpectedBC != __bc) // Check both for address-match, response-length and bit-corrector
		{
			// Ok we've timed out, try for 3 times
			if (iTotalRetryCount == (__XLINK_ATTEMPT_RETRY_MAXIMUM__ << 2))
			{
				// We've failed
				if (__senders_address != iAdrs)
				{
					*bTimeoutDetected = 5;
				}						
				else if (iExpectedBC != __bc)
				{
					*bTimeoutDetected = 50;
				}						
				else *bTimeoutDetected = 51;
						
				*bDeviceNotResponded = (iTotalSent == 0) ? 1 : 0;
				
				// Before doing anything, clear the CPLD
				MACRO_XLINK_clear_RX;				
				return;
			}
			else
			{
				iTotalRetryCount++;
				continue;
			}
		}
		
		
		// Reset retry count
		iTotalRetryCount = 0;

		// Resp was OK... Take the data
		if (__iRespLen >= 1 && (iTotalReceived + 1 <= iMaxRespLen)) { szResp[iTotalReceived++] = szDevResponse[0]; }
		if (__iRespLen >= 2 && (iTotalReceived + 1 <= iMaxRespLen)) { szResp[iTotalReceived++] = szDevResponse[1]; }
		if (__iRespLen >= 3 && (iTotalReceived + 1 <= iMaxRespLen)) { szResp[iTotalReceived++] = szDevResponse[2]; }
		if (__iRespLen >= 4 && (iTotalReceived + 1 <= iMaxRespLen)) { szResp[iTotalReceived++] = szDevResponse[3]; }
			  
		// We've sent 4 more bytes
		iBC = (iBC == 0) ? 1 : 0; // Flip BitCorrector
		iExpectedBC = (iExpectedBC == 0) ? 1 : 0; // Flip the expected BitCorrector
		
		// Was it the last packet? if so, exit the loop
		if (__lp == 1)
		{
			 imrActualTime++;
			 break;		
		}			 
		
		// Update imrTime
		vTemp1 = MACRO_GetTickCountRet;
		vTemp2 = vTemp1 - imrActualHolder;
		imrActualTime = vTemp2;		
		imrActualTime++;
	}		
	
	// Set the response size
	*response_length = iTotalReceived;
	
	// Reset TotalRetryCount
	iTotalRetryCount = 0;
						
	// We've received data, LP was detected. So now we send the TERM signal until we receive it, and then we're done...
	// Send TERM signal
	while (1)
	{
		// We need to reset watchdog
		WATCHDOG_RESET;
		
		// .................. ..... ...... .. .... ....
RETRY_POINT_3:
		// Before doing anything, clear the CPLD
		MACRO_XLINK_clear_RX;
		
		// Proceed
		MACRO_XLINK_send_packet(iAdrs,"TERM", 4, iLP, 0);
			
		// Reset variables
		iTimeoutDetected = 0;
		__iRespLen = 0;
		__lp = 0;
		__bc = 0;
		
		// Clear szDevResponse
		szDevResponse[0] = 0;
		szDevResponse[1] = 0;
		szDevResponse[2] = 0;
		szDevResponse[3] = 0;		
		
		// Wait for response
		MACRO_XLINK_wait_packet(szDevResponse,
								__iRespLen,
								(__XLINK_WAIT_PACKET_TIMEOUT__ >> 3),  // We wait an 4th of the maximum allowed, since we're master
								iTimeoutDetected,
								__senders_address,
								__lp,
								__bc);
						  
		// Check master timeout
		vTemp1 = MACRO_GetTickCountRet;
		vTemp3 = vTemp1 - iTransactionStartTickcount;
		
		if (vTemp3 > transaction_timeout + __XLINK_WAIT_FOR_DEVICE_RESPONSE__)
		{
			*bTimeoutDetected = 6;
			if (iTotalSent == 0) *bDeviceNotResponded = 1;
			
			// Before doing anything, clear the CPLD
			MACRO_XLINK_clear_RX;
			return;
		}

		// Check for issues
		if (iTimeoutDetected)
		{
			// Ok we've timed out, try for 3 times
			if (iTotalRetryCount == (__XLINK_ATTEMPT_RETRY_MAXIMUM__ << 3))
			{
				// We've failed
				*bTimeoutDetected = 7;
				*bDeviceNotResponded = (iTotalSent == 0) ? 1 : 0;
				
