futurehome/stm32bfg/AVR/ChainProtocol_Module.c
				// Before doing anything, clear the CPLD
				MACRO_XLINK_clear_RX;			
				return;
			}
			else
			{
				iTotalRetryCount++;
				goto RETRY_POINT_3;
			}
		}

		// No timeout was detected, check resp. If it was not ok, try again
		if ((__senders_address != iAdrs) || 
			(__lp == 0)			||
			(__iRespLen != 4)	||
			(szDevResponse[0] != 'T')	||
			(szDevResponse[1] != 'E')	||
			(szDevResponse[2] != 'R')	||
			(szDevResponse[3] != 'M')) // Check both for address-match and response-length
		{ 
			// Ok we've timed out, try for 3 times
			if (iTotalRetryCount ==  (__XLINK_ATTEMPT_RETRY_MAXIMUM__ << 3))
			{
				// We've failed
				*bTimeoutDetected = 8;
				*bDeviceNotResponded = (iTotalSent == 0) ? 1 : 0;
				
				// Before doing anything, clear the CPLD
				MACRO_XLINK_clear_RX;				
				return;
			}
			else
			{
				iTotalRetryCount++;
				goto RETRY_POINT_3;
			}
		}
		
		// If we've reached here it means we've successfully received 'TERM' response, so we're ok
		break;						  
	}

	// Clear RX
	MACRO_XLINK_clear_RX;

	// Reset errors and exit
	*bTimeoutDetected = 0;
	*bDeviceNotResponded = 0;
	return;	
}

// This is used by slave...
void XLINK_SLAVE_wait_transact (char  *data,
							    unsigned int *length,
							    unsigned int  max_len,
							    u32 transaction_timeout,
							    char  *bTimeoutDetected,
							    char  bWeAreMaster,
								char  bWaitingForCommand)
{
	unsigned int iTotalReceived = 0;
	u32  iActualTickcount;
	char  iBC = 0; // BitCorrector
	  char  iTotalRetryCount = 0;
	
	  char sziMX[16] = {0,0,0,0,0};

	  // What is our address?
	  char  our_address = __OUR_CPLD_ID;
	  //short iLoopCounter = 0;
	  u32 vTemp1 = 0;
	  //u32 vTemp2 = 0;
	  u32 vTemp3 = 0;
	  

	  // Respond with checksum
	  unsigned int iGeneratedChecksum = 0;

	  		  char iTimeoutDetected;
		  char szResp[4];
		  unsigned int  __iRespLen ;
		char __senders_address ;
		char __lp ;
		char __bc ;
	  
	// This is used by slave only, make sure we are slave..
	if (bWeAreMaster == 1) return;	
	
	// At this stage, the data has been sent, now we must ask Device for results...
	  //unsigned int iTotalReceived = 0;
	
	// This is how we do it, we start sending packets and we wait for response.
	// Each time we wait for 20us for reply. Should the device not respond, we abort the transaction
	  
	iActualTickcount = MACRO_GetTickCountRet;
	
	  
		
	
	
	
	
	
	// Now we have to wait for data
	while (iTotalReceived < max_len)
	{
		// Wait for OK packet for 20us
		  iTimeoutDetected = 0;
		  //char szResp[4];
		  __iRespLen = 0;
		  __senders_address = 0;
		  __lp = 0;
		  __bc = 0;
		
		// Clear the buffer
		szResp[0] = 0;
		szResp[1] = 0;
		szResp[2] = 0;
		szResp[3] = 0;
		
		MACRO_XLINK_wait_packet(szResp,
								__iRespLen,
								__XLINK_WAIT_PACKET_TIMEOUT__,  // For the first packet (only), we allow 120us delay
								iTimeoutDetected,
								__senders_address,
								__lp,
								__bc);
			
		// Check master timeout
		vTemp1 = MACRO_GetTickCountRet;
		vTemp3 = vTemp1 - iActualTickcount;
		if (vTemp3 > transaction_timeout)
		{
			*bTimeoutDetected = 1;
			return;
		}
			
		// Check for issues
		if (iTimeoutDetected)
		{
			// Ok we've timed out, try for 3 times
			*bTimeoutDetected = 1;
			return;
		}
			
		// No timeout was detected, check resp. If it was not ok, try again
		if (__iRespLen == 0) // Check both for address-match and response-length
		{
			// Ok we've timed out, try for several times
			if (iTotalRetryCount == __XLINK_ATTEMPT_RETRY_MAXIMUM__)
			{
				// We've failed
				*bTimeoutDetected = 1;
				return;
			}
			else
			{
				iTotalRetryCount++;
				continue;
			}
		}
		
		// Note that address 255 is always accepted! (it's a general dispatch)
		if (__senders_address == our_address)
		{
			// Ok, if not, we ignore...
		}
		else
		{
			// Ignore the packet!
			iTotalRetryCount++;			
			continue; 
		}
		
		// SPECIAL CASE: Is it a 'TERM' signal? If so, simply reply with TERM and ignore the whole story and continue the loop
		if ((iTotalReceived == 0) && (bWaitingForCommand == TRUE)) // Meaning that this is the first packet received...
		{
			if ((__iRespLen == 4) &&
				(szResp[0] == 'T') &&
				(szResp[1] == 'E') &&
				(szResp[2] == 'R') &&
				(szResp[3] == 'M'))
			{
				// Clear the Input buffer first
				MACRO_XLINK_clear_RX;				
				
				// Reply with TERM and repeat the loop
				MACRO_XLINK_send_packet(__OUR_CPLD_ID,"TERM",4, 1, 0);
				continue;
			}
			
			if ((__iRespLen == 3) &&
				(szResp[0] == 'Z') &&
				(szResp[1] == 'A') &&
				(szResp[2] == 'X'))
			{
				// Clear the Input buffer first
				MACRO_XLINK_clear_RX;
							
				// Reply with TERM and repeat the loop
				MACRO_XLINK_send_packet(__OUR_CPLD_ID,"ECHO",4, TRUE, FALSE);
				continue;
			}
		}
		
		// Check the BitCorrector:
		// If it's not what we expected it to be, then we need to go back and rewrite the bytes. We won't ignore it however
		/*if (__bc != iBC) // Bit corrector not matched. If we can, we need to roll-back the address
		{
			if (iTotalReceived > 3) iTotalReceived -= 4;
		}*/	
		
		// Reset the Checksum
		iGeneratedChecksum = 0;		
			
		// Resp was OK... Take the data
		if ((__iRespLen >= 1) && (iTotalReceived + 1 <= max_len))
		{
			 data[iTotalReceived] = szResp[0];
			 iGeneratedChecksum += szResp[0];			 
			 iTotalReceived += 1;
		}			 
		
		if ((__iRespLen >= 2) && (iTotalReceived + 1 <= max_len)) 
		{
			data[iTotalReceived] = szResp[1];
			iGeneratedChecksum  += szResp[1];			
			iTotalReceived += 1;
		}
					
		if ((__iRespLen >= 3) && (iTotalReceived + 1 <= max_len)) 
		{
			data[iTotalReceived] = szResp[2];
			iGeneratedChecksum  += szResp[2];			
			iTotalReceived += 1;
		}			
		
		if ((__iRespLen >= 4) && (iTotalReceived + 1 <= max_len)) 
		{
			data[iTotalReceived] = szResp[3];
			iGeneratedChecksum  += szResp[3];			
			iTotalReceived += 1;
		}			
		// We've sent 4 more bytes
		iBC = (iBC == 0) ? 1 : 0; // Flip BitCorrector
		
		// Clear the input buffer first
		MACRO_XLINK_clear_RX;
		
		// At this point, sent an OK back to sender
		sziMX[0] = 'A';
		sziMX[1] = 'R';
		sziMX[2] = (((iGeneratedChecksum & 0x0FF00) >> 8) & 0x0FF);
		sziMX[3] = (iGeneratedChecksum & 0x0FF);
		//sziMX[2] = 'T';
		//sziMX[3] = 'X';
		
