futurehome/stm32bfg/AVR/ChainProtocol_Module.c
		MACRO_XLINK_send_packet(__OUR_CPLD_ID,sziMX, 4, 1, 0);
		
		// Was it the last packet? if so, exit the loop
		if (__lp == 1) break;
	}		
		
	// OK, We've come out
	// there is nothing special to do...
	*bTimeoutDetected = 0;
	*length = iTotalReceived;
	return;								
}

void XLINK_SLAVE_respond_transact  (char  *data,
									unsigned int length,
									u32 transaction_timeout,
									char  *bTimeoutDetected,
									char  bWeAreMaster)
{
	// Wait for PUSH Command. Also remember, the first PUSH must have BitCorrector 0.
	// This is used by slave only, make sure we are slave..
	
	
	// What address do we used?
	  char iAddressToUseForTransactions = XLINK_get_cpld_id();
	
	// This is how we do it, we start sending packets and we wait for response.
	// Each time we wait for 20us for reply. Should the device not respond, we abort the transaction
	  unsigned int iActualTickcount ;
	  unsigned int iTotalSent = 0;
	  unsigned int iBytesToSend = 0;
	  char iBC = 1;	 // BitCorrector is ONE, since the previous part has already set it to one!
	  char iTotalRetryCount = 0;
	
	  char szPrevData[4];
	  char iPrevDataLen = 0;
	  char iPrevLP = 0;
	  char iPrevBC = 0;
	
	  u32 vTemp1;
	  //u32 vTemp2;
	  u32 vTemp3;

	  char iTimeoutDetected ;
		  char szResp[4];
		  unsigned int __iRespLen ;
		  char __senders_address ;
		  char __lp ;
		  char __bc ;
	  
	if (bWeAreMaster == 1) return;
	iActualTickcount = MACRO_GetTickCountRet;
	// Now we have to wait for data
	while (1)
	{
		// We need to reset watchdog
		WATCHDOG_RESET;
				
		// Wait for OK packet for 20us
		  iTimeoutDetected = 0;
		  //char szResp[4];
		  __iRespLen = 0;
		  __senders_address = 0;
		  __lp = 0;
		  __bc = 0;
		
RETRY_POINT_1:

		// Clear szResp
		szResp[0] = 0;
		szResp[1] = 0;
		szResp[2] = 0;
		szResp[3] = 0;
		
	   MACRO_XLINK_wait_packet(szResp,
							  __iRespLen,
							  __XLINK_WAIT_PACKET_TIMEOUT__,  // We wait for 200us
							  iTimeoutDetected,
							  __senders_address,
							  __lp,
							  __bc);
		
		// Check master timeout
		vTemp1 = MACRO_GetTickCountRet;
		vTemp3 = vTemp1 - iActualTickcount;
		if (vTemp3 > transaction_timeout)
		{
			*bTimeoutDetected = 1;
			MACRO_XLINK_clear_RX;			
			return;
		}
		
		// Check for issues
		if (iTimeoutDetected == TRUE)
		{
			// Did we time out?
			if (iTotalRetryCount > __XLINK_ATTEMPT_RETRY_MAXIMUM__)
			{
				// Ok we've timed out, try for 3 times
				*bTimeoutDetected = 1;
				MACRO_XLINK_clear_RX;
				return;	
			}
			else
			{
				iTotalRetryCount++;
				continue;
			}
		}
		
		// No timeout was detected, check resp. If it was not ok, try again
		if (__iRespLen == 0) // Check both for address-match and response-length
		{
			// Invalid command!...
			// Probably we have to abort...
			if (iTotalRetryCount == __XLINK_ATTEMPT_RETRY_MAXIMUM__)
			{
				// We've failed
				*bTimeoutDetected = 2;
				MACRO_XLINK_clear_RX;				
				return;			
			}
			else
			{
				// We will try again
				iTotalRetryCount++;
				goto RETRY_POINT_1;
			}
		}
		
		// Check for Host Response Data
		if ((szResp[0] != 'P') || 
			(szResp[1] != 'U') || 
			(szResp[2] != 'S') || 
			(szResp[3] != 'H') ||
		    (__iRespLen != 4))
		{
			// Invalid command!...
			// Probably we have to abort...
			if (iTotalRetryCount == __XLINK_ATTEMPT_RETRY_MAXIMUM__)
			{
				// We've failed
				*bTimeoutDetected = 3;
				MACRO_XLINK_clear_RX;				
				return;		
			}
			else
			{
				// Before doing anything, clear the CPLD
				MACRO_XLINK_clear_RX;
				
				// We will respond with 'OK' (perhaps the host has not received the OK from the time the first command was executed)
				MACRO_XLINK_send_packet(iAddressToUseForTransactions, "AR99", 4, TRUE, !iBC); // BitCorrector must never be correct for this				
				
				// We'll try again as well
				iTotalRetryCount++;
				goto RETRY_POINT_1;
			}
		}
		
		// OK, we either have to send new data, or old data (if BitCorrector doesn't match actual)
		if (__bc != iBC)
		{
			// Before doing anything, clear the CPLD
			MACRO_XLINK_clear_RX;
			
			// This means we have to send old data and continue the loop
			MACRO_XLINK_send_packet(iAddressToUseForTransactions, szPrevData, iPrevDataLen, iPrevLP, iPrevBC);
		}
		else // We send new data
		{

			// OK we send new data
			iBytesToSend = length - iTotalSent;
			if (iBytesToSend > 4) iBytesToSend = 4;
			iPrevLP = (iBytesToSend + iTotalSent >= length) ? 1 : 0;
			iPrevBC = iBC;
			iPrevDataLen = iBytesToSend;
			
			// Set previous data
			if (iBytesToSend >= 1) szPrevData[0] = data[iTotalSent+0];
			if (iBytesToSend >= 2) szPrevData[1] = data[iTotalSent+1];
			if (iBytesToSend >= 3) szPrevData[2] = data[iTotalSent+2];
			if (iBytesToSend == 4) szPrevData[3] = data[iTotalSent+3];
		
			// Before doing anything, clear the CPLD
			MACRO_XLINK_clear_RX;	
			
			// Now send the data
			MACRO_XLINK_send_packet(iAddressToUseForTransactions,szPrevData, iBytesToSend, iPrevLP, iBC);				
			
			// Flip the BitCorrector
			iBC = (iBC == 1) ? 0 : 1;
			iTotalSent += iBytesToSend;
			
			// Was it the last packet? If so, break the loop
			if (iPrevLP == 1) break;
		}
	}
	
	// Reset the retry count
	iTotalRetryCount = 0;

	// OK, we now here wait for TERM signal
	// Now we have to wait for data
	while (1)
	{
		// We need to reset watchdog
		WATCHDOG_RESET;
				
		// Wait for OK packet for 20us
		  iTimeoutDetected = 0;
		  //char szResp[4];
		 __iRespLen = 0;
		  __senders_address = 0;
		  __lp = 0;
		  __bc = 0;
		
RETRY_POINT_2:
		
		// Response clearing
		szResp[0] = 0; szResp[1] = 0; szResp[2] = 0;szResp[3] = 0;
		
		// Wait for the packet to arrive
		MACRO_XLINK_wait_packet(szResp,
							  __iRespLen,
							  __XLINK_WAIT_PACKET_TIMEOUT__,  // 200us Timeout
							  iTimeoutDetected,
							  __senders_address,
							  __lp,
							  __bc);
		
		// Check master timeout
		vTemp1 = MACRO_GetTickCountRet;
		vTemp3 = vTemp1 - iActualTickcount;
		if (vTemp3 > transaction_timeout)
		{
			*bTimeoutDetected = 4;
			MACRO_XLINK_clear_RX;
			return;
		}
		
		// Check for issues
		if (iTimeoutDetected)
		{
			// Ok we've timed out, try for 3 times
			*bTimeoutDetected = 5;
			MACRO_XLINK_clear_RX;
			return;
		}
		
		// No timeout was detected, check resp. If it was not ok, try again
		if (__iRespLen == 0) // Check both for address-match and response-length
		{
			// Invalid command!...
			// Probably we have to abort...
			if (iTotalRetryCount == __XLINK_ATTEMPT_RETRY_MAXIMUM__)
			{
				// We've failed
				*bTimeoutDetected = 6;
				MACRO_XLINK_clear_RX;				
				return;
			}
			else
			{
				// We will try again
				iTotalRetryCount++;
			}
		}
		
