futurehome/stm32bfg/AVR/ChainProtocol_Module.c
		// Check for Host Response Data
		if ((szResp[0] != 'T') ||
			(szResp[1] != 'E') ||
			(szResp[2] != 'R') ||
			(szResp[3] != 'M'))
		{
			// Is it PUSH? It must be regarding previous transaction. Probably the host didn't receive the packet
			// correctly. Send the last packet again. Of course, we do apply 20 attempt limit here
			if ((szResp[0] == 'P') &&
				(szResp[1] == 'U') &&
				(szResp[2] == 'S') &&
				(szResp[3] == 'H'))
			{
				if (iTotalRetryCount == __XLINK_ATTEMPT_RETRY_MAXIMUM__) // for TERM it's 20 retries
				{
					// We've failed
					*bTimeoutDetected = 7;
					MACRO_XLINK_clear_RX;					
					return;
				}
				else
				{
					// Resend the packet
					MACRO_XLINK_clear_RX;					
					MACRO_XLINK_send_packet(iAddressToUseForTransactions, szPrevData, iPrevDataLen, iPrevLP, iPrevBC);
					
					// We will try again
					iTotalRetryCount++;
					goto RETRY_POINT_2;
				}
			}
			else // It was not push either... OK never mind, we'll give it another try
			{
				if (iTotalRetryCount == __XLINK_ATTEMPT_RETRY_MAXIMUM__) // for TERM it's 20 retries
				{
					// We've failed
					*bTimeoutDetected = 8;
					MACRO_XLINK_clear_RX;						
					return;
				}
				else
				{
					// We will try again
					iTotalRetryCount++;
					goto RETRY_POINT_2;
				}
			}
		}
		
		// Before doing anything, clear the CPLD
		MACRO_XLINK_clear_RX;	
		
		// OK we've received our 'TERM'
		MACRO_XLINK_send_packet(iAddressToUseForTransactions, "TERM", 4, 1, 0);
		break; 
				
		// Now here is the catch: If the host won't received the TERM signal, it will resend it. The next TERM packet
		// will be received by our SLAVE_wait_transact. That function simply responds with 'TERM'. So everybody will be happy...
	}
	
	// OK, We've come out
	// there is nothing special to do...
	// XLINK_clear_RX();
	*bTimeoutDetected = 0;
	return;										
}

char XLINK_data_inbound(void)
{
	return ((XLINK_get_RX_status() & CPLD_RX_STATUS_DATA) == CPLD_RX_STATUS_DATA);
}	
							  
void  XLINK_set_cpld_id(char iID)
{
	
	char iValueToSet = 0;
	__AVR32_CPLD_SetAccess();
	MACRO__AVR32_CPLD_Read(iValueToSet,CPLD_ADDRESS_MASTER_CONTROL);
	iValueToSet &= ~(0x3E);
	iValueToSet |= ((iID & 0x1F) << 1);	
	MACRO__AVR32_CPLD_Write(CPLD_ADDRESS_MASTER_CONTROL, iValueToSet);	
	__OUR_CPLD_ID = iID;
}

char XLINK_get_cpld_id(void)
{
	return __OUR_CPLD_ID;
}

void  XLINK_set_cpld_master(char bMaster)
{
		
	char iValueToSet = 0;
	__AVR32_CPLD_SetAccess();
	MACRO__AVR32_CPLD_Read(iValueToSet, CPLD_ADDRESS_MASTER_CONTROL);
	iValueToSet &= ~(CPLD_MASTER_CONTROL_MSTR);
	if (bMaster) iValueToSet |= CPLD_MASTER_CONTROL_MSTR;
	MACRO__AVR32_CPLD_Write(CPLD_ADDRESS_MASTER_CONTROL, iValueToSet);
}

void  XLINK_set_cpld_passthrough(char bPassthrough)
{
	
	char iValueToSet = 0;
	__AVR32_CPLD_SetAccess();
	MACRO__AVR32_CPLD_Read(iValueToSet, CPLD_ADDRESS_MASTER_CONTROL);
	iValueToSet &= ~(CPLD_MASTER_CONTROL_PASSTHROUGH);
	if (bPassthrough == TRUE) iValueToSet |= CPLD_MASTER_CONTROL_PASSTHROUGH;	
	MACRO__AVR32_CPLD_Write(CPLD_ADDRESS_MASTER_CONTROL, iValueToSet);	
}

char XLINK_get_chain_status(void)
{
	
	char retval = 0;	
	__AVR32_CPLD_SetAccess();
	MACRO__AVR32_CPLD_Read(retval,CPLD_ADDRESS_CHAIN_STATUS);
	return retval;
}

char XLINK_get_TX_status(void)
{
			
	char retval = 0;	
	__AVR32_CPLD_SetAccess();
	MACRO__AVR32_CPLD_Read(retval, CPLD_ADDRESS_TX_STATUS);
	return retval;
}

char XLINK_get_RX_status(void)
{
	
	char retval = 0;	
	__AVR32_CPLD_SetAccess();
	MACRO__AVR32_CPLD_Read(retval, CPLD_ADDRESS_RX_STATUS);		
	return retval;
}

void XLINK_set_target_address(char uAdrs)
{
	__AVR32_CPLD_SetAccess();	
	MACRO__AVR32_CPLD_Write(CPLD_ADDRESS_TX_TARGET_ADRS, uAdrs & 0x1F);
}

char XLINK_get_target_address(void)
{
	
	char retVal = 0;
	__AVR32_CPLD_SetAccess();
	MACRO__AVR32_CPLD_Read(retVal, CPLD_ADDRESS_TX_TARGET_ADRS);
	return retVal;
}

void XLINK_clear_RX(void)
{
	__AVR32_CPLD_SetAccess();											
	MACRO__AVR32_CPLD_Write(CPLD_ADDRESS_RX_CONTROL, CPLD_RX_CONTROL_CLEAR);
}

int	XLINK_is_cpld_present(void)
{
	
	//char retVal = 0;
	//__AVR32_CPLD_SetAccess();
	//MACRO__AVR32_CPLD_Read(retVal,CPLD_ADDRESS_IDENTIFICATION);
	//return (retVal == 0x0A4);

	return 0;
}

char XLINK_get_device_status()
{
	return XLINK_Device_Status;
}

void XLINK_set_device_status(char iDevState)
{
	XLINK_Device_Status = iDevState;
}

void XLINK_set_outbox(char* szData, short iLen)
{
	unsigned int x;

	XLINK_Outbox_Length = iLen;
	for (x = 0; x < iLen; x++) XLINK_Outbox[x] = szData[x];
}
